/*
 Задача#7: Есть 3 вида товаров поставляемые в магазины через склад: мясо, фрукты, овощи. Склад с 5 воротами для загрузки/разгрузки, каждые ворота работают для одного вида товара, который разгружают/загружают первым. Вначале 3 ворот зарезервированны для разгрузки каждого вида товара, 2 остальных ворот свободны и могут использоваться и для разгрузки и для загрузки. Ворота могут переключиться  на другой вип товара при загрузке если текущий вид закончился или превышает на 50 тонн текущий. Товары развозят фурами вместимостью по 10 тонн. Скорость разгрузки/загрузки 1 машины 2 тонны в час. Машины, привозящие товар, можно генерировать, к примеру по 15 штук каждые 24 часа.*/
#include <iostream>
using namespace std;
int main() {

    return 0;
}
